[TRReward_StealSpark X2RewardTemplate]
DisplayName="SPARK Unit"

[CovertActionNarrative_InvestigateSpark X2CovertActionNarrativeTemplate]
ActionName="Investigate ADVENT's SPARK"
ActionPreNarrative="Word from our informants is ADVENT has created a SPARK unit. We should investigate to understand the threat and determine if we should disrupt this."
ActionPostNarrative="Our operatives managed to locate the SPARK unit. And security seems to lack more than usual. We have an opportunity to steal this SPARK for our own efforts."

[CovertActionNarrative_HeistSpark X2CovertActionNarrativeTemplate]
ActionName="SPARK Heist"
ActionPreNarrative="We found a blind spot in their security protocol which would give us an opportunity to perform our SPARK heist. Commander, we should not let this pass. If what we hear is anything to go by, <font color='#E52E11'><XGParam:StrValue4/></font> is a very capable unit."
ActionPostNarrative="Gottem! The programming of this SPARK is unfinished but I am sure Shen can work her magic!"